In [1]:
import pandas as pd
web={'Day':[1,2,3,4,5,6],'Vistors':[1200,700,5500,540,400,340],'BounceRate':[20,30,22,15,10,35]}
df= pd.DataFrame(web)

Slicing

In [7]:
df

   Day  Vistors  BounceRate
0    1     1200          20
1    2      700          30
2    3     5500          22
3    4      540          15
4    5      400          10
5    6      340          35

In [8]:
df.head(3)

   Day  Vistors  BounceRate
0    1     1200          20
1    2      700          30
2    3     5500          22

In [10]:
df.tail(4)

   Day  Vistors  BounceRate
2    3     5500          22
3    4      540          15
4    5      400          10
5    6      340          35

Merging

In [12]:
df1=pd.DataFrame({'HPI':[90,70,60,80],'Int_rate':[2,3,1,2],'Ind_GDP':[50,35,40,45],'Year':[2015,2016,2017,2018]})

In [13]:
df1

   HPI  Int_rate  Ind_GDP  Year
0   90         2       50  2015
1   70         3       35  2016
2   60         1       40  2017
3   80         2       45  2018

In [14]:
df2=pd.DataFrame({'HPI':[90,70,60,80],'Int_rate':[2,3,1,2],'Ind_GDP':[50,35,40,45],'Year':[2005,2006,2007,2008]})

In [15]:
df2

   HPI  Int_rate  Ind_GDP  Year
0   90         2       50  2005
1   70         3       35  2006
2   60         1       40  2007
3   80         2       45  2008

In [18]:
mer=pd.merge(df1,df2,on="HPI")

In [19]:
mer

   HPI  Int_rate_x  Ind_GDP_x  Year_x  Int_rate_y  Ind_GDP_y  Year_y
0   90           2         50    2015           2         50    2005
1   70           3         35    2016           3         35    2006
2   60           1         40    2017           1         40    2007
3   80           2         45    2018           2         45    2008

Joining

In [24]:
df3=pd.DataFrame({'Int_Rate':[2,1,2,3],'Ind_Gdp':[50,45,35,65],'year':[2016,2017,2018,2019]})

In [29]:
df4=pd.DataFrame({'Low_Tier':[50,45,35,65],'Unemployment':[1,3,5,7],'year1':[2006,2021,2013,2022]})

In [30]:
join=df3.join(df4)

In [31]:
join

   Int_Rate  Ind_Gdp  year  Low_Tier  Unemployment  year1
0         2       50  2016        50             1   2006
1         1       45  2017        45             3   2021
2         2       35  2018        35             5   2013
3         3       65  2019        65             7   2022

Concatenation

In [32]:
df5=pd.DataFrame({'HPI':[90,70,60,80],'Int_rate':[2,3,1,2],'Ind_GDP':[50,35,40,45],'Year':[2005,2006,2007,2008]})
df6=pd.DataFrame({'HPI':[90,70,60,80],'Int_rate':[2,3,1,2],'Ind_GDP':[50,35,40,45],'Year':[2015,2016,2017,2018]})

In [33]:
concat=pd.concat([df5,df6])

In [34]:
concat

   HPI  Int_rate  Ind_GDP  Year
0   90         2       50  2005
1   70         3       35  2006
2   60         1       40  2007
3   80         2       45  2008
0   90         2       50  2015
1   70         3       35  2016
2   60         1       40  2017
3   80         2       45  2018

In [35]:
concat=pd.concat([df5,df6],axis=1)

In [36]:
concat

   HPI  Int_rate  Ind_GDP  Year  HPI  Int_rate  Ind_GDP  Year
0   90         2       50  2005   90         2       50  2015
1   70         3       35  2006   70         3       35  2016
2   60         1       40  2007   60         1       40  2017
3   80         2       45  2008   80         2       45  2018

Change the Index

In [40]:
df1= pd.DataFrame({'Day':[1,2,3,4],'Vistors':[200,120,300,350],'Bounce_Rate':[20,35,45,55]})
df1.set_index('Day',inplace=True)

In [41]:
print(df1)

     Vistors  Bounce_Rate
Day
1        200           20
2        120           35
3        300           45
4        350           55

Change the Headers

In [42]:
df1=df1.rename(columns={"Vistors":"Users"})

In [43]:
df1

     Users  Bounce_Rate
Day
1      200           20
2      120           35
3      300           45
4      350           55

Pandas Series

In [44]:
s=pd.Series()
print(s)

Series([], dtype: float64)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

In [45]:
import numpy as np

In [46]:
data=np.array(['a','b','c','d'])
x=pd.Series(data)
print(x)

0    a
1    b
2    c
3    d
dtype: object

In [48]:
data={'a':12,'b':25,'c':35}
x=pd.Series(data)
print(x)

a    12
b    25
c    35
dtype: int64

In [49]:
exam_data={'Student':['Shivam','Shashank','Saurabh','Suryansh','Venkatesh'],
           'Rank':[1,2,3,2,3],
           'Year':[2013,2013,2014,2015,2016],
           'Marks':[850,740,890,670,810]}
df=pd.DataFrame(exam_data)

In [50]:
df

     Student  Rank  Year  Marks
0     Shivam     1  2013    850
1   Shashank     2  2013    740
2    Saurabh     3  2014    890
3   Suryansh     2  2015    670
4  Venkatesh     3  2016    810

In [51]:
print(df.groupby('Student'))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f354b2304d0>

In [53]:
print(df.groupby('Student').groups)

{'Saurabh': [2], 'Shashank': [1], 'Shivam': [0], 'Suryansh': [3], 'Venkatesh': [4]}

In [54]:
data=pd.read_csv("Data.csv")

In [55]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [56]:
data.shape

(10, 4)

In [57]:
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [58]:
data.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [59]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [62]:
data.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [71]:
data.Age=data.Age.fillna(data.Age.median())
data['Salary']=data['Salary'].fillna(data['Salary'].mean())
#data['Age']=data['Age'].fillna(data['Age'].mean())

In [72]:
data.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [73]:
data

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes
6    Spain  38.0  52000.000000        No
7   France  48.0  79000.000000       Yes
8  Germany  50.0  83000.000000        No
9   France  37.0  67000.000000       Yes

In [75]:
data.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [76]:
data.loc[2:5]

   Country   Age        Salary Purchased
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes

In [77]:
data.loc[data.Age>40]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No

In [83]:
display(data.iloc[2:5])

   Country   Age        Salary Purchased
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes

In [79]:
data.Country.value_counts()

France     4
Germany    3
Spain      3
Name: Country, dtype: int64

In [81]:
data.Country.unique()

array(['France', 'Spain', 'Germany'], dtype=object)